import random
from pyrogram import Client, filters
from info import COMMAND_HAND_LER
from plugins.helper_functions.cust_p_filters import f_onw_fliter


RUN_STRINGS = (
    "ઓહ..અહંકાર...બસ એવું જ...કોઈ બદલાવ...કંઈ ખોટું નથી...!!!",

    "અલ્લાહ...દરેક...બાળકોનો જુસ્સો...",

    "મને આવડતું નથી કે કેવી રીતે લખવું સાહેબ.... મને વાંચતા આવડતું નથી...",

    "આજે ચૂપ રહો...આજના કિલ્લા પછી...",

    "જે કોલસો રાખ ગણાય છે, જો તેને બાંધવામાં ન આવે, તો તે બળી જશે."

    "સમજો કે એક જ જીવન છે, કોઈ સ્વર્ગ નથી, નર્ક નથી, 'એક જ જીવન' છે, આ બધું ક્યાં અને કેવી રીતે કરવું."

    "કેવો ધગધગતો વિસ્ફોટ! આવો ભયાનક સાક્ષાત્કાર!!",

    "મારી પત્ની અને દીકરીના ઘરે જાવ, તમે મૂર્ખ નથી, આજની એક મિનિટ પણ... નીચે ન જાવ.",

    "હું તે કરી શકું છું, હું તે કરી શકું છું",

    "ટાઈગર બિસ્કિટમાં વાઘ હોવા જરૂરી નથી કારણ કે તેઓ માને છે કે ક્રીમ બિસ્કિટમાં ક્રીમ છે.",

    "હું યુદ્ધથી ડરી ગયો અને પંડાલમ ગયો.",

    "મારા ભગવાન... તું મને સરસ નહિ રહેવા દે.",

    "કારનું એન્જીન સંપૂર્ણપણે આઉટ......",

    "મધરફકર ઈઝ નોટ ઓર!!",

    "શું તમારા પપ્પાએ અડધી રાત માટે પોર્રીજ અને ચિકન બનાવ્યા...",

    "ઓહ, જ્યારે તમે બધા પ્રેમ કરો છો ત્યારે તે પ્રેમ છે.... જ્યારે આપણે બધા પ્રેમ કરીએ છીએ ત્યારે તે તાર છે...",

    "ભગવાન મને એકલા બચાવો...",

    "તાડી પીઓ અને ભીનો વરસાદ તેની યાદમાં બગાડ હતો...",

    "ક્યાં છો આટલા દિવસો...!",

    "મને અંગ્રેજી બહુ સારી રીતે આવડતું નથી...",

    "બધા સપના ટ્વિંકલ સ્ટાર્સ જેવા...",

    "મારા દાદા મુથપ્પા પોતાનો રસ્તો બનાવે છે",

    "શું તમે મને મારી બહેન આલિયા સાથે બાંધેલું દહેજ આપી શકશો",

    "તમે ખૂબ થાકી ગયા છો",

    "મારી આંખોમાં આંસુ સિવાય હું રાહ જોઈ રહ્યો હતો.",

    "કૃષ્ટા. "\,

    "લોહીલુહાણ ગામવાસીઓ તમારું મોં બંધ કરો.",

    "જાઓ અને મરી જાઓ."\,

   " તમારી સાથે મરવા માટે પેટો." ,

    "તારી સાથે, ગુણોલ્યાના વતની અને વતની, ગુણોલ્યા, તને આમ જીવવામાં કેમ આટલી શરમ આવે છે?"
    
    )

@Client.on_message(
    filters.command("runs", COMMAND_HAND_LER) &
    f_onw_fliter
)
async def runs(_, message):
    """ /runs strings """
    effective_string = random.choice(RUN_STRINGS)
    if message.reply_to_message:
        await message.reply_to_message.reply_text(effective_string)
    else:
        await message.reply_text(effective_string)
